sysbench/output_64/cacheline64/oltp-point-select.out
sysbench 1.1.0-bd4b418 (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 1
Report intermediate results every 5 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 5s ] thds: 1 tps: 11622.22 qps: 11622.22 (r/w/o: 11622.22/0.00/0.00) lat (ms,95%): 0.10 err/s: 0.00 reconn/s: 0.00
[ 10s ] thds: 1 tps: 11626.68 qps: 11626.68 (r/w/o: 11626.68/0.00/0.00) lat (ms,95%): 0.10 err/s: 0.00 reconn/s: 0.00
[ 15s ] thds: 1 tps: 11558.66 qps: 11558.66 (r/w/o: 11558.66/0.00/0.00) lat (ms,95%): 0.10 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 1 tps: 11633.07 qps: 11633.07 (r/w/o: 11633.07/0.00/0.00) lat (ms,95%): 0.10 err/s: 0.00 reconn/s: 0.00
[ 25s ] thds: 1 tps: 11618.15 qps: 11618.15 (r/w/o: 11618.15/0.00/0.00) lat (ms,95%): 0.10 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 1 tps: 11546.25 qps: 11546.25 (r/w/o: 11546.25/0.00/0.00) lat (ms,95%): 0.10 err/s: 0.00 reconn/s: 0.00
[ 35s ] thds: 1 tps: 11110.54 qps: 11110.54 (r/w/o: 11110.54/0.00/0.00) lat (ms,95%): 0.11 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 1 tps: 11555.81 qps: 11555.81 (r/w/o: 11555.81/0.00/0.00) lat (ms,95%): 0.10 err/s: 0.00 reconn/s: 0.00
[ 45s ] thds: 1 tps: 11409.26 qps: 11409.26 (r/w/o: 11409.26/0.00/0.00) lat (ms,95%): 0.11 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 1 tps: 11588.83 qps: 11588.83 (r/w/o: 11588.83/0.00/0.00) lat (ms,95%): 0.10 err/s: 0.00 reconn/s: 0.00
[ 55s ] thds: 1 tps: 11550.06 qps: 11550.06 (r/w/o: 11550.06/0.00/0.00) lat (ms,95%): 0.10 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            691757
        write:                           0
        other:                           0
        total:                           691757
    transactions:                        691757 (11528.86 per sec.)
    queries:                             691757 (11528.86 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      11528.8612
    time elapsed:                        60.0022s
    total number of events:              691757

Latency (ms):
         min:                                    0.07
         avg:                                    0.09
         max:                                    8.42
         95th percentile:                        0.10
         sum:                                59718.97

Threads fairness:
    events (avg/stddev):           691757.0000/0.00
    execution time (avg/stddev):   59.7190/0.00

sysbench 1.1.0-bd4b418 (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 2
Report intermediate results every 5 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 5s ] thds: 2 tps: 22751.33 qps: 22751.33 (r/w/o: 22751.33/0.00/0.00) lat (ms,95%): 0.11 err/s: 0.00 reconn/s: 0.00
[ 10s ] thds: 2 tps: 22991.61 qps: 22991.61 (r/w/o: 22991.61/0.00/0.00) lat (ms,95%): 0.10 err/s: 0.00 reconn/s: 0.00
[ 15s ] thds: 2 tps: 22949.45 qps: 22949.45 (r/w/o: 22949.45/0.00/0.00) lat (ms,95%): 0.11 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 2 tps: 23091.54 qps: 23091.54 (r/w/o: 23091.54/0.00/0.00) lat (ms,95%): 0.10 err/s: 0.00 reconn/s: 0.00
[ 25s ] thds: 2 tps: 22963.97 qps: 22963.97 (r/w/o: 22963.97/0.00/0.00) lat (ms,95%): 0.11 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 2 tps: 23075.04 qps: 23075.04 (r/w/o: 23075.04/0.00/0.00) lat (ms,95%): 0.10 err/s: 0.00 reconn/s: 0.00
[ 35s ] thds: 2 tps: 21568.61 qps: 21568.61 (r/w/o: 21568.61/0.00/0.00) lat (ms,95%): 0.11 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 2 tps: 22968.76 qps: 22968.76 (r/w/o: 22968.76/0.00/0.00) lat (ms,95%): 0.11 err/s: 0.00 reconn/s: 0.00
[ 45s ] thds: 2 tps: 22831.99 qps: 22831.99 (r/w/o: 22831.99/0.00/0.00) lat (ms,95%): 0.11 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 2 tps: 23088.80 qps: 23088.80 (r/w/o: 23088.80/0.00/0.00) lat (ms,95%): 0.10 err/s: 0.00 reconn/s: 0.00
[ 55s ] thds: 2 tps: 22996.33 qps: 22996.33 (r/w/o: 22996.33/0.00/0.00) lat (ms,95%): 0.11 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            1371739
        write:                           0
        other:                           0
        total:                           1371739
    transactions:                        1371739 (22861.46 per sec.)
    queries:                             1371739 (22861.46 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      22861.4560
    time elapsed:                        60.0023s
    total number of events:              1371739

Latency (ms):
         min:                                    0.07
         avg:                                    0.09
         max:                                   23.42
         95th percentile:                        0.11
         sum:                               119403.70

Threads fairness:
    events (avg/stddev):           685869.5000/507.50
    execution time (avg/stddev):   59.7018/0.00

sysbench 1.1.0-bd4b418 (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 4
Report intermediate results every 5 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 5s ] thds: 4 tps: 35996.46 qps: 35996.46 (r/w/o: 35996.46/0.00/0.00) lat (ms,95%): 0.15 err/s: 0.00 reconn/s: 0.00
[ 10s ] thds: 4 tps: 35638.23 qps: 35638.23 (r/w/o: 35638.23/0.00/0.00) lat (ms,95%): 0.15 err/s: 0.00 reconn/s: 0.00
[ 15s ] thds: 4 tps: 34874.90 qps: 34874.90 (r/w/o: 34874.90/0.00/0.00) lat (ms,95%): 0.16 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 4 tps: 38387.99 qps: 38387.99 (r/w/o: 38387.99/0.00/0.00) lat (ms,95%): 0.15 err/s: 0.00 reconn/s: 0.00
[ 25s ] thds: 4 tps: 40577.38 qps: 40577.38 (r/w/o: 40577.38/0.00/0.00) lat (ms,95%): 0.14 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 4 tps: 43126.96 qps: 43126.96 (r/w/o: 43126.96/0.00/0.00) lat (ms,95%): 0.11 err/s: 0.00 reconn/s: 0.00
[ 35s ] thds: 4 tps: 33854.79 qps: 33854.79 (r/w/o: 33854.79/0.00/0.00) lat (ms,95%): 0.17 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 4 tps: 36321.02 qps: 36321.02 (r/w/o: 36321.02/0.00/0.00) lat (ms,95%): 0.17 err/s: 0.00 reconn/s: 0.00
[ 45s ] thds: 4 tps: 40876.98 qps: 40876.98 (r/w/o: 40876.98/0.00/0.00) lat (ms,95%): 0.14 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 4 tps: 41026.33 qps: 41026.33 (r/w/o: 41026.33/0.00/0.00) lat (ms,95%): 0.13 err/s: 0.00 reconn/s: 0.00
[ 55s ] thds: 4 tps: 43062.10 qps: 43062.10 (r/w/o: 43062.10/0.00/0.00) lat (ms,95%): 0.10 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 4 tps: 43509.19 qps: 43509.19 (r/w/o: 43509.19/0.00/0.00) lat (ms,95%): 0.10 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            2336342
        write:                           0
        other:                           0
        total:                           2336342
    transactions:                        2336342 (38936.81 per sec.)
    queries:                             2336342 (38936.81 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      38936.8147
    time elapsed:                        60.0034s
    total number of events:              2336342

Latency (ms):
         min:                                    0.07
         avg:                                    0.10
         max:                                   25.59
         95th percentile:                        0.15
         sum:                               238149.99

Threads fairness:
    events (avg/stddev):           584085.5000/8025.33
    execution time (avg/stddev):   59.5375/0.01

sysbench 1.1.0-bd4b418 (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 8
Report intermediate results every 5 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 5s ] thds: 8 tps: 41496.23 qps: 41496.23 (r/w/o: 41496.23/0.00/0.00) lat (ms,95%): 0.27 err/s: 0.00 reconn/s: 0.00
[ 10s ] thds: 8 tps: 41884.91 qps: 41884.91 (r/w/o: 41884.91/0.00/0.00) lat (ms,95%): 0.27 err/s: 0.00 reconn/s: 0.00
[ 15s ] thds: 8 tps: 40625.76 qps: 40625.76 (r/w/o: 40625.76/0.00/0.00) lat (ms,95%): 0.28 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 8 tps: 40502.39 qps: 40502.39 (r/w/o: 40502.39/0.00/0.00) lat (ms,95%): 0.33 err/s: 0.00 reconn/s: 0.00
[ 25s ] thds: 8 tps: 40121.72 qps: 40121.72 (r/w/o: 40121.72/0.00/0.00) lat (ms,95%): 0.34 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 8 tps: 39533.35 qps: 39533.35 (r/w/o: 39533.35/0.00/0.00) lat (ms,95%): 0.35 err/s: 0.00 reconn/s: 0.00
[ 35s ] thds: 8 tps: 38388.14 qps: 38388.14 (r/w/o: 38388.14/0.00/0.00) lat (ms,95%): 0.34 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 8 tps: 33411.81 qps: 33411.81 (r/w/o: 33411.81/0.00/0.00) lat (ms,95%): 0.39 err/s: 0.00 reconn/s: 0.00
[ 45s ] thds: 8 tps: 39833.05 qps: 39833.05 (r/w/o: 39833.05/0.00/0.00) lat (ms,95%): 0.35 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 8 tps: 40648.46 qps: 40648.46 (r/w/o: 40648.46/0.00/0.00) lat (ms,95%): 0.32 err/s: 0.00 reconn/s: 0.00
[ 55s ] thds: 8 tps: 40448.31 qps: 40448.31 (r/w/o: 40448.31/0.00/0.00) lat (ms,95%): 0.32 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            2393767
        write:                           0
        other:                           0
        total:                           2393767
    transactions:                        2393767 (39894.01 per sec.)
    queries:                             2393767 (39894.01 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      39894.0128
    time elapsed:                        60.0032s
    total number of events:              2393767

Latency (ms):
         min:                                    0.07
         avg:                                    0.20
         max:                                   32.53
         95th percentile:                        0.32
         sum:                               478290.83

Threads fairness:
    events (avg/stddev):           299220.8750/5420.64
    execution time (avg/stddev):   59.7864/0.01

sysbench 1.1.0-bd4b418 (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 16
Report intermediate results every 5 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 5s ] thds: 16 tps: 40389.58 qps: 40389.58 (r/w/o: 40389.58/0.00/0.00) lat (ms,95%): 0.51 err/s: 0.00 reconn/s: 0.00
[ 10s ] thds: 16 tps: 39336.58 qps: 39336.58 (r/w/o: 39336.58/0.00/0.00) lat (ms,95%): 0.77 err/s: 0.00 reconn/s: 0.00
[ 15s ] thds: 16 tps: 39266.32 qps: 39266.32 (r/w/o: 39266.32/0.00/0.00) lat (ms,95%): 0.68 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 16 tps: 40797.48 qps: 40797.48 (r/w/o: 40797.48/0.00/0.00) lat (ms,95%): 0.57 err/s: 0.00 reconn/s: 0.00
[ 25s ] thds: 16 tps: 40633.30 qps: 40633.30 (r/w/o: 40633.30/0.00/0.00) lat (ms,95%): 0.59 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 16 tps: 40553.17 qps: 40553.17 (r/w/o: 40553.17/0.00/0.00) lat (ms,95%): 0.62 err/s: 0.00 reconn/s: 0.00
[ 35s ] thds: 16 tps: 38494.13 qps: 38494.13 (r/w/o: 38494.13/0.00/0.00) lat (ms,95%): 0.61 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 16 tps: 38394.74 qps: 38394.74 (r/w/o: 38394.74/0.00/0.00) lat (ms,95%): 0.62 err/s: 0.00 reconn/s: 0.00
[ 45s ] thds: 16 tps: 34812.96 qps: 34812.96 (r/w/o: 34812.96/0.00/0.00) lat (ms,95%): 0.74 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 16 tps: 40236.06 qps: 40236.06 (r/w/o: 40236.06/0.00/0.00) lat (ms,95%): 0.58 err/s: 0.00 reconn/s: 0.00
[ 55s ] thds: 16 tps: 40634.06 qps: 40634.06 (r/w/o: 40634.06/0.00/0.00) lat (ms,95%): 0.48 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            2371269
        write:                           0
        other:                           0
        total:                           2371269
    transactions:                        2371269 (39519.10 per sec.)
    queries:                             2371269 (39519.10 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      39519.0980
    time elapsed:                        60.0031s
    total number of events:              2371269

Latency (ms):
         min:                                    0.08
         avg:                                    0.40
         max:                                   68.74
         95th percentile:                        0.62
         sum:                               958020.40

Threads fairness:
    events (avg/stddev):           148204.3125/3031.96
    execution time (avg/stddev):   59.8763/0.02

sysbench 1.1.0-bd4b418 (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 32
Report intermediate results every 5 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 5s ] thds: 32 tps: 41499.24 qps: 41499.24 (r/w/o: 41499.24/0.00/0.00) lat (ms,95%): 0.47 err/s: 0.00 reconn/s: 0.00
[ 10s ] thds: 32 tps: 41763.33 qps: 41763.33 (r/w/o: 41763.33/0.00/0.00) lat (ms,95%): 0.57 err/s: 0.00 reconn/s: 0.00
[ 15s ] thds: 32 tps: 41996.85 qps: 41996.85 (r/w/o: 41996.85/0.00/0.00) lat (ms,95%): 0.81 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 32 tps: 41870.87 qps: 41870.87 (r/w/o: 41870.87/0.00/0.00) lat (ms,95%): 0.61 err/s: 0.00 reconn/s: 0.00
[ 25s ] thds: 32 tps: 42134.14 qps: 42134.14 (r/w/o: 42134.14/0.00/0.00) lat (ms,95%): 0.28 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 32 tps: 41992.10 qps: 41992.10 (r/w/o: 41992.10/0.00/0.00) lat (ms,95%): 0.58 err/s: 0.00 reconn/s: 0.00
[ 35s ] thds: 32 tps: 39968.46 qps: 39968.46 (r/w/o: 39968.46/0.00/0.00) lat (ms,95%): 0.83 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 32 tps: 41231.34 qps: 41231.34 (r/w/o: 41231.34/0.00/0.00) lat (ms,95%): 0.84 err/s: 0.00 reconn/s: 0.00
[ 45s ] thds: 32 tps: 35046.59 qps: 35046.59 (r/w/o: 35046.59/0.00/0.00) lat (ms,95%): 2.35 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 32 tps: 40493.94 qps: 40493.94 (r/w/o: 40493.94/0.00/0.00) lat (ms,95%): 2.18 err/s: 0.00 reconn/s: 0.00
[ 55s ] thds: 32 tps: 41744.71 qps: 41744.71 (r/w/o: 41744.71/0.00/0.00) lat (ms,95%): 0.92 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            2459596
        write:                           0
        other:                           0
        total:                           2459596
    transactions:                        2459596 (40988.53 per sec.)
    queries:                             2459596 (40988.53 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      40988.5284
    time elapsed:                        60.0069s
    total number of events:              2459596

Latency (ms):
         min:                                    0.08
         avg:                                    0.78
         max:                                  127.19
         95th percentile:                        0.80
         sum:                              1917924.84

Threads fairness:
    events (avg/stddev):           76862.3750/1579.34
    execution time (avg/stddev):   59.9352/0.02